Revit 2026 API

# ViewDisableTemporaryViewMode Method

---

Disables the specified temporary view mode.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void DisableTemporaryViewMode(
	TemporaryViewMode mode
)
```
```vb
Public Sub DisableTemporaryViewMode (
	mode As TemporaryViewMode
)
```
```cpp
public:
void DisableTemporaryViewMode(
	TemporaryViewMode mode
)
```
```fsharp
member DisableTemporaryViewMode :
        mode : TemporaryViewMode -> unit
```

#### Parameters

mode TemporaryViewMode
     The mode to disable.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | View cannot use temporary visibility modes. |

Has no effect if the mode is already disabled.

#### Reference

View Class

Autodesk.Revit.DB Namespace